Autodesk.Revit.DB.Structure.ReinforcementSettings.SetReinforcementAbbreviationTag(Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType,System.String)
Sets one abbreviation tag for desired ReinforcementAbbreviationTagType.
tagType:
Defines the type of abbreviation tag.
abbreviationTag:
Abbreviation tag value to set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The abbreviation type tagType is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.ReinforcementSettings.GetReinforcementAbbreviationTag(Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType)
Gets one abbreviation tag for desired ReinforcementAbbreviationTagType.
tagType:
Defines the type of abbreviation tag.
Returns:
Abbreviation tag value
Throws Autodesk.Revit.Exceptions.ArgumentException:
The abbreviation type tagType is not valid
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.ReinforcementSettings.GetReinforcementAbbreviationTags(Autodesk.Revit.DB.Structure.ReinforcementAbbreviationObjectType)
Gets a list of abbreviation tags for desired reinforcement object type.
objectType:
Defines the type of desired reinforcement object for abbreviation tags.
Returns:
An array of ReinforcementAbbreviationTag that will define all abbreviations for given reinforcement object.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.ReinforcementSettings.GetFabricRoundingManager
Returns an object for managing reinforcement rounding override settings used by FabricSheetType and FabricSheet elements.
Returns:
The rounding manager.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementSettings.GetRebarRoundingManager
Returns an object for managing reinforcement rounding override settings used by RebarBarTypes, Rebar and RebarInSystem elements.
Returns:
The rounding manager.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementSettings.IsEqual(Autodesk.Revit.DB.Structure.ReinforcementSettings)
Checks if Reinforcement Settings is equal to other
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Structure.ReinforcementSettings.GetReinforcementSettings(Autodesk.Revit.DB.Document)
Obtains the ReinforcementSettings object for the specified project document.
cda:
A project document.
Returns:
The ReinforcementSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentException:
cda is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarVaryingLengthNumberSuffix
A unique identifier used for a bar within a variable length rebar set.
Remarks:
This property affects only Rebar sets under the following conditions:
1. The distribution type (Autodesk::Revit::DB::Rebar::distributionType) of the Rebar is DistributionType::Enum::VaryingLength.2. There are at least two bars within the Rebar set that have different shape parameter values (i.e at least two bars vary in length).The shape parameters of a Rebar can be accessed via Autodesk::Revit::DB::Structure::RebarShapeDefinition::getParameters method.The parameters at a specific index in a Rebar set can be accessed via Autodesk::Revit::DB::Structure::Rebar::getParameterValueAtIndex method. This property is assigned to varying Rebar sets
only if they are numbered as a whole (i.e. Autodesk.Revit.DB.Structure.ReinforcementSettings.NumberVaryingLengthRebarsIndividually is set to false).
The values for this property are valid if :
Input contains at least one character.Input contains either alphabetical or numeric characters (not both).
When this property is used, each bar in a varying set will be assigned an incremented value of the suffix.
As an example, the suffix values for three bars in a varying set are:
For alphabetic suffix : Aaz -> Aba -> Abb.For numeric suffix : 129 -> 130 -> 131.
These values are automatically incremented by the system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The rebar number suffix is not valid if :
Input is empty.Input contains non-alphanumeric characters.Input contains both numeric and alphabetic characters.Input is a value that exceeds the maximum  integer representation.Input contains more than 6 alphabetic characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2017

Autodesk.Revit.DB.Structure.ReinforcementSettings.NumberVaryingLengthRebarsIndividually
Use this option to modify the way varying length bars are numbered (individually or as a whole).
Remarks:
This property affects only Rebar sets under the following conditions:
1. The distribution type (Autodesk::Revit::DB::Rebar::distributionType) of the Rebar is DistributionType::Enum::VaryingLength.2. There are at least two bars within the Rebar set that have different shape parameter values (i.e at least two bars vary in length).The shape parameters of a Rebar can be accessed via Autodesk::Revit::DB::Structure::RebarShapeDefinition::getParameters method.The parameters at a specific index in a Rebar set can be accessed via Autodesk::Revit::DB::Structure::Rebar::getParameterValueAtIndex method. If this property is true, then the Revit numbering mechanism (Autodesk::Revit::DB::NumberingSchema)
will assign each bar, in a varying set, a number.
The number is assigned based on the Revit numbering logic. (For example if two bars are identical, they will receive the same number).
The numbering mechanism will compare varying bars with other varying or uniform bars within the project. (i.e each bar in a varying set is interpreted as an individual Rebar).
If this property is false, the following happens:
1. The Revit numbering mechanism (Autodesk::Revit::DB::NumberingSchema)
will assign a unique number for each varying Rebar set.
Each bar within the varying set will have(share) the same number that was assigned for the entire set.
Even if two varying Rebar sets are identical, they will be assigned different numbers.2. Each bar within a varying set will also be assigned a suffix parameter (REBAR_NUMBER_SUFFIX).
This suffix parameter will receive values based on the Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarVaryingLengthNumberSuffix property.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2017

Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarPresentationInSection
The default presentation mode for rebar sets, when:
The view direction is perpendicular to the rebar normal and the rebar set is cut.The view direction is not perpendicular to the rebar normal and the view direction is not parallel to the rebar normal.
Remarks:
All bars in a given rebar set will be visible if:
The view is a 3D view.The view direction is not parallel to the rebar normal.
For this case there are no defaults and no overrides in instances.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarPresentationInView
The default presentation mode for rebar sets, when the view direction is perpendicular to the rebar normal and the rebar set is not cut.
Remarks:
All bars in a given rebar set will be visible if:
The view is a 3D view.The view direction is not parallel to the rebar normal.
For this case there are no defaults and no overrides in instances.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarShapeDefinesEndTreatments
End Treatments are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more Rebar elements.
-or-
When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more AreaReinforcement or PathReinforcement
elements.
-or-
When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more RebarContainer elements.
the document contains one or more RebarContainer elements.
Since:
2017

Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarShapeDefinesHooks
Hooks are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more Rebar elements.
-or-
When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more AreaReinforcement or PathReinforcement
elements.
-or-
When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more RebarContainer elements.
the document contains one or more RebarContainer elements.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementSettings.HostStructuralRebar
Host Structural Rebar within Area and Path Reinforcement with touching AtomHostStructuralRebar.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Cannot change the RebarShapeDefinesHooks property in these settings because the document contains one or more AreaReinforcement or PathReinforcement
elements.
Since:
2013

Autodesk.Revit.DB.Structure.ReinforcementSettings
Provides access to project-wide reinforcement settings.
Since:
2013